# UnifiedBitmap Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnifiedBitmap Class
Members See Also
---
A static class that provides access to the property names that appear in the UnifiedBitmap visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static class UnifiedBitmap
```

Visual Basic
---
```text
Public NotInheritable Class UnifiedBitmap
```

Visual C++
---
```text
public ref class UnifiedBitmap abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..UnifiedBitmap
# See Also
UnifiedBitmap Members
Autodesk.Revit.DB.Visual Namespace